// ghz-config.js
const GHZconfigData = {
  "tabs": [
    "D1",
    "D2",
    "D3",
    "D4",
    "D5",
    "简单分刀"
  ],
  "activeTab": 0,
  "d1Images": [
    "./工会战/d1/07b5d0f71815795fde5bb2922b54aadd353996433.png",
    "./工会战/d1/69bb77fb0b35ad1247a604398dcc7498353996433.png",
    "./工会战/d1/9f82e14c3206f5233a5c377229d89a8b353996433.png",
    "./工会战/d1/Image_1782277795029_476.png",
    "./工会战/d1/Image_1782277822955_612.png",
    "./工会战/d1/QQ图片20260626160056.jpeg",
    "./工会战/d1/QQ图片20260626160202.jpeg"
  ],
  "d2Images": [
    "./工会战/d2/0bdbb19986585b8f9d3dae7b6609ef23353996433.png",
    "./工会战/d2/79007ed799f1489fe3dc256aaaf7a398353996433.png",
    "./工会战/d2/Image_1782277820209_259.png",
    "./工会战/d2/QQ图片20260626160207(1).jpeg.jpeg"
  ],
  "d3Images": [
    "./工会战/d3/32f756f626b6f3e4f8066875993b6eb0353996433.png",
    "./工会战/d3/a6143a6306d6e455fde376b2b4f55341353996433.png",
    "./工会战/d3/f7a43f1ef5cfbc9fcec76783c981b63f353996433.png",
    "./工会战/d3/f98835548d13c5b70d6d0f3dd1723500353996433.png",
    "./工会战/d3/Image_1782277809500_513.png",
    "./工会战/d3/Image_1782277812232_366.png",
    "./工会战/d3/Image_1782277815088_563.png",
    "./工会战/d3/Image_1782277817631_114.png",
    "./工会战/d3/QQ图片20260626160238(2).jpeg"
  ],
  "d4Images": [
    "./工会战/d4/57d5748510e7716560dcdd8d7e21aeb7353996433.png",
    "./工会战/d4/75d922a9b0c6d0639433a005bbd573b1353996433.png",
    "./工会战/d4/e77ea454a83fd8fc0c8bab56c5b45f87353996433.png",
    "./工会战/d4/Image_1782277806885_941.png",
    "./工会战/d4/QQ图片20260626160238(3).jpeg"
  ],
  "d5Images": [
    "./工会战/d5/378e61c0d058fe72e5bbe7887c39d172353996433.png",
    "./工会战/d5/57af2f9d29d92b5079dedd0f68b0bbb0353996433.png",
    "./工会战/d5/beaa7d0a37b47437506bc2022039852e353996433.png",
    "./工会战/d5/f62094207160bd6e36cb9d051c171d95353996433.png",
    "./工会战/d5/Image_1782277798909_90.png",
    "./工会战/d5/Image_1782277801806_786.png",
    "./工会战/d5/QQ图片20260626160238(4).jpeg",
    "./工会战/d5/QQ图片20260626160238(5).jpeg",
    "./工会战/d5/QQ图片20260626160335.png"
  ],
  "d6Images": [
    "./工会战/set刀/ev1.png",
    "./工会战/set刀/ev2.png",
    "./工会战/set刀/ev3.png",
    "./工会战/set刀/ev4.png",
    "./工会战/set刀/ev5.png",
    "./工会战/set刀/hw1.png",
    "./工会战/set刀/hw2.png",
    "./工会战/set刀/hw3.png",
    "./工会战/set刀/hw4.png",
    "./工会战/set刀/hw5.png",
    "./工会战/set刀/hw6.png",
    "./工会战/set刀/hw7.png",
    "./工会战/set刀/mx1.png",
    "./工会战/set刀/mx2.png",
    "./工会战/set刀/mx3.png",
    "./工会战/set刀/mx4.png",
    "./工会战/set刀/nc1.png",
    "./工会战/set刀/nc2.png",
    "./工会战/set刀/nc3.png",
    "./工会战/set刀/nc4.png",
    "./工会战/set刀/nc5.png",
    "./工会战/set刀/nc6.png",
    "./工会战/set刀/nc7.png",
    "./工会战/set刀/nc8.png",
    "./工会战/set刀/wjm1.png",
    "./工会战/set刀/wjm2.png",
    "./工会战/set刀/wjm3.png",
    "./工会战/set刀/wjm4.png",
    "./工会战/set刀/wjm5.png"
  ],
  "showBigImg": false,
  "bigImgSrc": "",
  "videoLinks": [
    {
      "name": "汐汐的奇幻历险[手动-简单set刀]",
      "url": "https://space.bilibili.com/189151967",
      "cover": "./工会战/汐.jpg"
    },
    {
      "name": "玩具喵Official[自动-简单set刀]",
      "url": "",
      "cover": "./工会战/wjm.jpg"
    },
    {
      "name": "墨夕困困想睡觉[自动-简单set刀]",
      "url": "",
      "cover": "./工会战/mx.jpg"
    },
    {
      "name": "玖璃梦_花舞组[自动-简单set刀]",
      "url": "",
      "cover": "./工会战/花舞.jpg"
    },
    {
      "name": "这是一个好记的昵称[自动-简单set刀]",
      "url": "https://www.bilibili.com/video/BV1JHE96YExE",
      "cover": "./工会战/nc.jpg"
    },
    {
      "name": "-Evexy-[自动&手动-简单set刀]",
      "url": "https://www.bilibili.com/opus/1216322931414532137?spm_id_from=333.1387.0.0",
      "cover": "./工会战/evexy.jpg"
    },
    {
      "name": "浮城墟烟[简单set刀]",
      "url": "https://www.bilibili.com/video/BV1uEjS6wEGd",
      "cover": "./工会战/浮.jpg"
    }
  ]
};
  
  // 导出配置数据
  if (typeof module !== 'undefined' && typeof module.exports !== 'undefined') {
      module.exports = GHZconfigData;
  } else {
      window.configData = GHZconfigData;
  }