const imagePaths = {
    huodong: [
        "./活动角色/h1.png"
    ],
    gachaPools: [
        "./卡池/圣吃.png",
        "./卡池/圣妹.png",
        "./卡池/姐妹.png",
        "./卡池/情姐.png",
        "./卡池/新年初音.png",
        "./卡池/春圣母.png",
        "./卡池/礼yly.png",
        "./卡池/自选4.png",
        "./卡池/自选5.png",
        "./卡池/蝶妈.png"
    ],
    sixStar: [
        "./六星/61.png",
        "./六星/tp.png",
        "./六星/嘉夜.png",
        "./六星/狼.png",
        "./六星/祈梨.png",
        "./六星/驴.png"
    ],
    activities: [
        "./图标/主线关卡.png",
        "./图标/团队战.png",
        "./图标/困难关卡.png",
        "./图标/圣迹调查.png",
        "./图标/地下城.png",
        "./图标/大师币.png",
        "./图标/妈.png",
        "./图标/宝箱.png",
        "./图标/庆典.png",
        "./图标/扭蛋.png",
        "./图标/探索.png",
        "./图标/竞技场.png",
        "./图标/露娜塔.png"
    ],
    specialWeapons: [
        "./专武/兔克.png",
        "./专武/初音、栞.png",
        "./专武/吃货-2.png",
        "./专武/圣千-2.png",
        "./专武/圣妹.png",
        "./专武/圣姐.png",
        "./专武/圣胡-2.png",
        "./专武/圣锤-2.png",
        "./专武/圣骑.png",
        "./专武/奶牛-2.png",
        "./专武/情姐-2.png",
        "./专武/情理-2.png",
        "./专武/春圣母.png",
        "./专武/江深.png",
        "./专武/狂虎.png",
        "./专武/蝶妈.png",
        "./专武/龙马.png"
    ]
};